app/controllers/store_controller.rb

  def index
    @products=Product.find_product_for_sale
---
SELECT * FROM "products" ORDER BY title

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("updated_at", "product_id", "order_id", "quantity", "total_price", "created_at") VALUES('2014-05-22 02:28:15', 1, 1, 1, 29.95, '2014-05-22 02:28:15')
INSERT INTO "orders" ("updated_at", "email", "name", "pay_type", "address", "created_at") VALUES('2014-05-22 02:28:15', 'a@a.com', 'zhangsan', 'check', 'sfsdfs', '2014-05-22 02:28:15')

  def add_to_cart
    product=Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)